# INTRODUCTION TO DATA WAREHOUSE (DW or DWH)
DWH is a system used for reporting and data analysis, it is considered a core component of business intelligence. Think of a DWH as data stored in one or more sources integrated into a single and easy-to-understand format for creating analytical report

DWH is usually extracted from an operational database systems (data that holds the information current performed activities in a database)

# DIVING IN 
To fully understands what DWH is, it is important to know what OLTP, OLAP and Dimensional modelling is.

## Online Transaction Processing (OLTP)
OLTP databases are optimized to handle large number of `insert, update and delete`. OLTP systems emphasize very fast query processing and maintaining data integrity in multi-access environments. The schema used to store OLTP databases is the entity model (usually third normal form, 3NF) and effectiveness is measured by number of transaction per second. Think of OLTP as `I want to get things done fast and accurate`. Example includes
* Making a search on a particular item and to know its current price
* Updating information of a worker and their position in an organisation

## Online Analytical Processing (OLAP)
OLAP databases are characterized by a relatively low volume of transaction and are optimized to handle reads and complex aggregations, they are usually use to get business insights. OLAP databases store historical data in multiple dimensional schemas (usually `star schema`). Response time is an effectiveness measure in OLAP. Think of OLAP as `"Hey, I want to know why this is happening, what is really going on?"`. Example includes
* In a particular location, how much sales did we make?
* What is the total number items we shipped in last month and to which location?

## DIMENSIONAL MODELLING (DM)
The is a part of the methodology which includes a set of methods, techniques and concepts for use in data warehouse. DM focueses on identifying the key business processes within business processes. DM uses the `facts (measures)` and `dimension (context)`. Fact are usually numeric values that can be aggregated, example of fact includes sale amount and profits amount. Dimensions on other hand are groups of hierarchies and descriptors that define the fact, example of dimension includes timestamp, product, location etc. Dimension modelling is an easy to understand and more intuitive models compared to 3NF models. 

Clearly, fron the note above, it obvious the when considering DWH, we need to focus on OLAP and DM. DM is the basic concept for DWH and it has to be designed to optimized OLAP system.

# ETL
ETL simply means Extract, Transform and Load and it is the process of extracting data from one or more data sources, transforming the data into more understandable forms and moving it into another database. Data modelling is essential tools in ETL to best fit the data into its most effective form.

# OPERATIONAL AND ANALYTICAL PROCESS
We have talked briefly on data warehouse and dimensional modelling, in data warehouse we are simply focused on the analytical processes unlike OLTP. So, like say we have an operational database optimized for high data integrity and no redundancy (a 3NF database), can we possibly use that same database for analytical processes?

Yes, we can but we will have a complicated data for business intelligence, too many joins will be considered and it will be hard to understand. Designing new database that is easy to understand will be a best practice to help the business intelligence to perform the analytical processes on the business data.

To understand the needed for data modelling for data warehouse, we will do a  simple walk through using an operational database to perform analytical processes and how complicated it can be. We wil then move to writing an ELT process that does the data modelling into dimensions and fact table to ease analytical processes (creating a data warehouse)

I have used an open source `Pagila database` postgres for this demostration,you can read the documentation
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

# Working with `PAGILA DB`


## Importing neccessary Libraries

In [1]:
%load_ext sql
import psycopg2
from psycopg2 import Error
import pandas as pd
from datetime import datetime
df = pd.read_csv('detail.csv')

# getting login details
user = df["user"].iloc[0]
password = df["password"].iloc[0]

## Making connection to sakila_db

In [2]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila_db'
DB_USER = "postgres"
DB_PASSWORD = password
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn= "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

%sql $conn

'Connected: postgres@pagila_db'

# Explore the 3NF Schema

![Screenshot (156)](https://user-images.githubusercontent.com/55639062/78954076-ddbb9380-7ad2-11ea-887e-f6f8a33d020b.png)

## Printing out table

In [3]:
# %sql SELECT tablename FROM pg_tables WHERE schemaname='public';

pagila_t = pd.read_sql_query("SELECT tablename FROM pg_tables WHERE schemaname='public';", conn)
tables = pagila_t["tablename"]
tables

0              payment
1                 film
2                actor
3              address
4             category
5                 city
6              country
7             customer
8           film_actor
9        film_category
10           inventory
11            language
12              rental
13               staff
14               store
15    payment_p2017_01
16    payment_p2017_02
17    payment_p2017_03
18    payment_p2017_04
19    payment_p2017_05
20    payment_p2017_06
21             dimdate
22         dimcustomer
23            dimmovie
24            dimstore
25           factsales
Name: tablename, dtype: object

## How much? What data sizes are we looking at?

In [5]:
for table in tables:
    query = f"SELECT count(*) from {table};"
    s = pd.read_sql_query(query, conn)
    if s.values[0][0] > 1000:
        print("n_{}\t\t = {}\n".format(table, s.values[0][0]))

n_payment		 = 16049

n_film_actor		 = 5462

n_inventory		 = 4581

n_rental		 = 16044

n_payment_p2017_01		 = 1157

n_payment_p2017_02		 = 2312

n_payment_p2017_03		 = 5644

n_payment_p2017_04		 = 6754

n_factsales		 = 16049

# Performing some simple data analysis
I will try to write `OLAP insight` on our database `(in 3NF)`. Insight includes:
* Get the movie of every payment
* Get the sum movie rental revenue
* Get the city of each payment
* Get the top grossing cities
* Get each movie by customer city and by month (data cube)
* Get the sum of revenue of each movie by customer city and by month


## Get the movie of every payment

In [6]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM 
    payment p
JOIN 
    rental r ON ( p.rental_id = r.rental_id )
JOIN 
    inventory i ON ( r.inventory_id = i.inventory_id )
JOIN 
    film f ON ( i.film_id = f.film_id)
LIMIT 5;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 269)]

## Get the sum of top 10 movie rental revenue

In [7]:
%%sql
SELECT f.title, sum(p.amount) as revenue
FROM 
    film f
JOIN
    inventory i ON ( i.film_id = f.film_id )
JOIN
    rental r ON ( r.inventory_id = i.inventory_id)
JOIN
    payment p  ON ( p.rental_id = r.rental_id )
GROUP BY f.title
ORDER BY revenue DESC
LIMIT 10;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

## Get the city of each payment

In [8]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city                         
FROM 
    payment p
JOIN
    customer c  ON ( p.customer_id = c.customer_id )
JOIN
    address a ON ( c.address_id = a.address_id )
JOIN
    city ci ON ( a.city_id = ci.city_id )
ORDER BY p.payment_date
limit 10;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

## Get the top grossing cities

In [9]:
%%sql
SELECT c.city, sum(p.amount) as revenue
FROM 
    city c
JOIN
    address a ON ( a.city_id = c.city_id )
JOIN
    customer cu ON ( cu.address_id = a.address_id)
JOIN
    payment p  ON ( p.customer_id = cu.customer_id)
GROUP BY c.city
ORDER BY revenue DESC
LIMIT 10;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

## Get each movie by customer city and by month (data cube)

In [10]:
%%sql
SELECT  
    f.title, p.amount, p.customer_id, ci.city, p.payment_date,
    EXTRACT(month FROM p.payment_date) as month_num
FROM 
    payment p
JOIN 
    rental r    ON ( p.rental_id = r.rental_id )
JOIN 
    inventory i ON ( r.inventory_id = i.inventory_id )
JOIN 
    film f ON ( i.film_id = f.film_id)
JOIN 
    customer c  ON ( p.customer_id = c.customer_id )
JOIN 
    address a ON ( c.address_id = a.address_id )
JOIN 
    city ci ON ( a.city_id = ci.city_id )
ORDER BY p.payment_date
LIMIT 10;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2017, 1, 24, 21, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2017, 1, 24, 21, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2017, 1, 24, 21, 33, 7, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2017, 1, 24, 21, 33, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2017, 1, 24, 21, 36, 33, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2017, 1, 24, 22, 0, 12, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2017, 1, 24, 22, 29, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2017, 1, 24, 22, 30, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1.0)]

## Get the sum of revenue of each movie by customer city and by month

In [11]:
%%sql
SELECT  
    f.title, ci.city, 
    EXTRACT(month FROM p.payment_date) as month_num, 
    sum(p.amount) as revenue
FROM 
    payment p
JOIN 
    rental r    ON ( p.rental_id = r.rental_id )
JOIN 
    inventory i ON ( r.inventory_id = i.inventory_id )
JOIN 
    film f ON ( i.film_id = f.film_id)
JOIN 
    customer c  ON ( p.customer_id = c.customer_id )
JOIN 
    address a ON ( c.address_id = a.address_id )
JOIN 
    city ci ON ( a.city_id = ci.city_id )
GROUP BY (f.title, ci.city, month_num)
ORDER BY month_num, revenue DESC
LIMIT 10;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
10 rows affected.

[('SHOW LORD', 'Mannheim', 1.0, Decimal('11.99')),
 ('CASUALTIES ENCINO', 'Warren', 1.0, Decimal('10.99')),
 ('KISSING DOLLS', 'Toulon', 1.0, Decimal('10.99')),
 ('AMERICAN CIRCUS', 'Callao', 1.0, Decimal('10.99')),
 ('TELEGRAPH VOYAGE', 'Naala-Porto', 1.0, Decimal('10.99')),
 ('STRANGER STRANGERS', 'Ipoh', 1.0, Decimal('9.99')),
 ('HEAD STRANGER', 'Xiangtan', 1.0, Decimal('9.99')),
 ('MISSION ZOOLANDER', 'Abha', 1.0, Decimal('9.99')),
 ('MILLION ACE', 'Gaziantep', 1.0, Decimal('9.99')),
 ('DARKO DORADO', 'Bhilwara', 1.0, Decimal('9.99'))]

# Conclusion
From the above queries, it is clear the queries is not performant for the insights needed because of the joins for these dataset let alone a larger dataset and writing the queries is not that easy, there was a lot of check ups and it takes time. There is a need to do dimensional modelling on the dataset to have easy access to the database and to query need insight as fast as possible

# Dimensional Modeling
To do DM, I will perform an ETL operation on the `pagila_db` and I will create fact and dimensions table using the data in pagila database


## 3NF - Entity Relationship Diagram

![Screenshot (156)](https://user-images.githubusercontent.com/55639062/78954076-ddbb9380-7ad2-11ea-887e-f6f8a33d020b.png)


## Star Schema - Entity Relationship Diagram

![Screenshot (155)](https://user-images.githubusercontent.com/55639062/78954308-a1d4fe00-7ad3-11ea-9c62-9afe4641ea19.png)

For the data modelling, I will use the star schema above to create dimensions and fact table

## Creating dimension table

In [12]:
%%sql
DROP TABLE IF EXISTS dimDate;
DROP TABLE IF EXISTS dimMovie;
DROP TABLE IF EXISTS dimStore;
DROP TABLE IF EXISTS dimCustomer;

CREATE TABLE dimDate
(   
    date_key    integer NOT NULL PRIMARY KEY,
    date        date NOT NULL,
    year        smallint NOT NULL,
    quarter     smallint NOT NULL,
    month       smallint NOT NULL,
    day         smallint NOT NULL,
    week        smallint NOT NULL,
    is_weekend  boolean
);

CREATE TABLE dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### Check to see table field name and data types if entered correctly

In [13]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'dimmovie'

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
11 rows affected.

[('movie_key', 'integer'),
 ('film_id', 'smallint'),
 ('title', 'character varying'),
 ('description', 'text'),
 ('release_year', 'integer'),
 ('language', 'character varying'),
 ('original_language', 'character varying'),
 ('rental_duration', 'smallint'),
 ('length', 'smallint'),
 ('rating', 'character varying'),
 ('special_features', 'character varying')]

# Creating Fact table

In [14]:
%%sql
DROP TABLE IF EXISTS factSales;

CREATE TABLE factSales
(
  sale_key      SERIAL PRIMARY KEY,
  date_key      integer NOT NULL,
  customer_key  integer NOT NULL,
  movie_key     integer NOT NULL,
  store_key     integer NOT NULL,
  sale_amount   decimal(5,2) NOT NULL
);

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
Done.
Done.

[]

# ETL the data from 3NF table to Fact and Dimension tables
**`IMPORTANT:`** The ETL depends on first having successing completed the creation of the fact and dimension table

## Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

`Let create a test_table`

In [15]:
%%sql
DROP TABLE IF EXISTS test_table;

CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
Done.
Done.

[]

After creating test_table, use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [16]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
16049 rows affected.

[]

Looking at the data inserted into the test_table

In [17]:
%sql SELECT * FROM test_table LIMIT 5;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

We can now drop the test_table

In [18]:
%sql DROP TABLE IF EXISTS test_table

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
Done.

[]

Above is just a test of SQ ETL, now I'll do the same thing below to create the dimension and fact tables for the star schema using the data in the 3NF database

# ETL from 3NF to Star Schema

In this section, I will popuate the tables in star shcema. I'll `extract` data from the normalized database, `transform` it and `load` it into the new tables 

NOTE: The EXTRACT function extracts date parts from the payment_date variable

## ETL into dimDate table

In [19]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
40 rows affected.

[]

## ETL into dimCustomer table

In [20]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name,
            email, address, address2, district, city, country, postal_code,
             phone, active, create_date, start_date, end_date)
SELECT  c.customer_id   AS customer_key,
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        a.phone,
        c.active,
        c.create_date,
        now()           AS start_date,
        now()           AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
599 rows affected.

[]

In [21]:
%sql SELECT * FROM dimcustomer LIMIT 5;

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 4, 9), datetime.date(2020, 4, 9)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 4, 9), datetime.date(2020, 4, 9)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 4, 9), datetime.date(2020, 4, 9)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 4, 9), datetime.date(2020, 4, 9)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 4, 9), datetime.date(2020, 4, 9))]

In [22]:
## ETL into dimMovie table

In [23]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description,
                release_year, language, original_language, rental_duration,
                length, rating, special_features
)

SELECT  f.film_id           AS movies_key,
        f.film_id,
        f.title,
        f.description,
        f.release_year,
        l.name              AS language,
        ol.name             AS original_language,
        rental_duration,
        f.length,
        f.rating,
        f.special_features
FROM film f
JOIN language l       ON (f.language_id=l.language_id)
LEFT JOIN language ol ON (f.original_language_id = ol.language_id);

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
1000 rows affected.

[]

In [24]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'factsales'

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
6 rows affected.

[('sale_key', 'integer'),
 ('date_key', 'integer'),
 ('customer_key', 'integer'),
 ('movie_key', 'integer'),
 ('store_key', 'integer'),
 ('sale_amount', 'numeric')]

## ETL into dimStore table

In [25]:
%%sql
INSERT INTO dimStore(store_key, store_id, address, address2, district, city,
        country, postal_code, manager_first_name, manager_last_name,
        start_date, end_date
)
SELECT  s.store_id          AS store_key,
        s.store_id,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        st.first_name       AS manager_first_name,
        st.last_name        AS manager_last_name,
        now()               AS start_date,
        now()               AS end_date
FROM store s
JOIN address a  ON ( a.address_id = s.address_id )
JOIN city ci    ON ( ci.city_id = a.city_id )
JOIN country co ON ( co.country_id = ci.country_id )
JOIN staff st   ON ( st.staff_id = s.manager_staff_id );

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
2 rows affected.

[]

## ETL into factSales table

In [26]:
%%sql
INSERT INTO factsales ( date_key,
                        customer_key,
                        movie_key,
                        store_key,
                        sale_amount
)
SELECT  
    TO_CHAR( p.payment_date :: DATE, 'yyyyMMDD') :: integer AS date_key,
    p.customer_id                                           AS customer_key,
    i.film_id                                               AS movie_key,
    i.store_id                                              AS store_key,
    p.amount                                                AS sale_amount
FROM payment p
JOIN rental r       ON ( r.rental_id = p.rental_id )
JOIN inventory i    ON (r.inventory_id = i.inventory_id );

* postgresql://postgres:***@127.0.0.1:5432/pagila_db
16049 rows affected.

[]